Repository: I-Am-Saksham-Srivastavaa/BlackholeReimagined
Catalog: assets/readme/*.arb
Languages: hi

# repoSubtitle
source: An Open-Source Music Player App for all your needs!
hi: आपकी सभी संगीत आवश्यकताओं के लिए एक ओपन-सोर्स म्यूजिक प्लेयर ऐप!

# badgesRow
source: [![made-with-flutter](https://img.shields.io/badge/Made%20with-Flutter-1f425f.svg)](https://flutter.dev/) ![Release](https://img.shields.io/github/v/release/I-Am-Saksham-Srivastavaa/BlackHole) ![Downloads](https://img.shields.io/github/downloads/I-Am-Saksham-Srivastavaa/BlackHole/total) [![Build](https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/actions/workflows/flutter.yml/badge.svg)](https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/actions/workflows/flutter.yml) [![Translation-Status](https://hosted.weblate.org/widgets/blackhole/-/translations/svg-badge.svg)](https://hosted.weblate.org/engage/blackhole/)
hi: [![made-with-flutter](https://img.shields.io/badge/Made%20with-Flutter-1f425f.svg)](https://flutter.dev/) ![Release](https://img.shields.io/github/v/release/I-Am-Saksham-Srivastavaa/BlackHole) ![Downloads](https://img.shields.io/github/downloads/I-Am-Saksham-Srivastavaa/BlackHole/total) [![Build](https://img.shields.io/github/workflow/status/I-Am-Saksham-Srivastavaa/BlackHole/Flutter%20Build)](https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/actions)

# starTheRepo
source: ### Don't forget to :star: the repo
hi: ### कृपया इस रेपो को :star: करें

# repoGitHubStats
source: [![GitHub stars](https://img.shields.io/github/stars/I-Am-Saksham-Srivastavaa/BlackHole.svg?style=social&label=Star)](https://github.com/I-Am-Saksham-Srivastavaa/BlackHole) ![GitHub forks](https://img.shields.io/github/forks/I-Am-Saksham-Srivastavaa/BlackHole.svg?style=social&label=Forks) ![GitHub followers](https://img.shields.io/github/followers/I-Am-Saksham-Srivastavaa.svg?style=social&label=Follow)
hi: [![GitHub stars](https://img.shields.io/github/stars/I-Am-Saksham-Srivastavaa/BlackHole.svg?style=social&label=Star)](https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/stargazers)

# downloadSection
source: ## Download [<img src="get_website.png" alt="Download from Website" height="90">](https://I-Am-Saksham-Srivastavaa.github.io/download/) [<img src="get_github.png" alt="Download from GitHub" height="90">](https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/releases) [<img src="get_telegram.png" alt="Join Telegram Channel" height="90">](https://t.me/blackhole_official) [<img src="https://fdroid.gitlab.io/artwork/badge/get-it-on.png" alt="Get it on F-Droid" height="90">](https://f-droid.org/packages/com.infinity.oryn/) [<img src="https://gitlab.com/IzzyOnDroid/repo/-/raw/master/assets/IzzyOnDroid.png" alt="Get it on IzzyDroid" height="90">](https://android.izzysoft.de/repo/apk/com.infinity.oryn)
hi: ## डाउनलोड करें [<img src="get_website.png" alt="Download from Website" height="90">](https://I-Am-Saksham-Srivastavaa.github.io/download/) [<img src="get_github.png" alt="Download from GitHub" height="90">](https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/releases)

# translationsSection
source: ## Translations - [Turkish :tr:](/README.TR.md) - [Spanish :es:](/README.ES.md) - [Russian :ru:](/README.RU.md) - [French :fr:](/README.FR.md) - [Portuguese :brazil:](/README.PT.md) - [Japanese :jp:](/README.JA.md) - [Belarusian :belarus:](/README.BE.md) - [Indonesian :indonesia:](/README.ID.md) [Translate App on Weblate](https://hosted.weblate.org/projects/blackhole/translations/)
hi: ## अनुवाद - [तुर्की :tr:](/README.TR.md) - [स्पेनिश :es:](/README.ES.md) - [रूसी :ru:](/README.RU.md) - [फ्रेंच :fr:](/README.FR.md) - [पुर्तगाली :brazil:](/README.PT.md) - [जापानी :jp:](/README.JA.md) - [बेलारूसी :belarus:](/README.BE.md) - [इंडोनेशियाई :indonesia:](/README.ID.md) [Translate App on Weblate](https://hosted.weblate.org/projects/I-Am-Saksham-Srivastavaa/BlackHole/)

# featuresSection
source: ## Features - High Streaming Quality (320kbps AAC) - Song, Album, Artist and Playlist Search - Language Specific Promoted Playlists - Trending Songs - Artist and Genre Radios - Support 15+ music languages - Local and Global Top Spotify songs - Add Songs to Favorite - Playlists support - Import Playlists from Spotify & YouTube - Import/Export Playlists as JSON File - Share Playlists - Sleep timer - Lyrics Support - Queue Management - Listening history record - Dark mode / accent color - Custom Gradients and other Theme options - Supports Portrait as well as Landscape mode - Download for offline play (320kbps with ID3 tags) - Play Online as well as Offline Songs - Tag Editing Support - Trending Search Results - YouTube Search Support - Promoted Youtube Playlists - Play videos as audio - Auto Song Recommendations - Inbuilt Equalizer - Backup & Restore - Auto Update Check - Cache support - No Subscription - No Ads and much more... Check it yourself :)
hi: ## विशेषताएँ - उच्च स्ट्रीमिंग गुणवत्ता (320kbps AAC) - गाने, एल्बम, कलाकार और प्लेलिस्ट खोजें - भाषा विशिष्ट प्रचारित प्लेलिस्ट - ट्रेंडिंग गाने - कलाकार और शैली रेडियो - 15+ संगीत भाषाओं का समर्थन - स्थानीय और वैश्विक शीर्ष Spotify गाने - गाने पसंदीदा में जोड़ें - प्लेलिस्ट समर्थन - Spotify और YouTube से प्लेलिस्ट आयात करें - JSON फ़ाइल के रूप में प्लेलिस्ट आयात/निर्यात करें - प्लेलिस्ट साझा करें - स्लीप टाइमर - गीत समर्थन - कतार प्रबंधन - सुनने का इतिहास रिकॉर्ड करें - डार्क मोड / एक्सेंट रंग - कस्टम ग्रेडिएंट्स और अन्य थीम विकल्प - पोर्ट्रेट और लैंडस्केप मोड दोनों का समर्थन करता है - ऑफ़लाइन खेलने के लिए डाउनलोड करें (320kbps के साथ ID3 टैग) - ऑनलाइन और ऑफ़लाइन गाने चलाएं - टैग संपादन समर्थन - ट्रेंडिंग खोज परिणाम - YouTube खोज समर्थन - प्रचारित YouTube प्लेलिस्ट - वीडियो को ऑडियो के रूप में चलाएं - स्वचालित गाना अनुशंसाएँ - इनबिल्ट इक्वलाइज़र - बैकअप और पुनर्स्थापना - स्वचालित अपडेट जांचें - कैश समर्थन करता है - कोई सदस्यता नहीं है - कोई विज्ञापन नहीं है

# screenshotsSection
source: <img src="https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/blob/main/fastlane/metadata/android/en-US/images/phoneScreenshots/1.png?raw=true" width="32%"> <img src="https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/blob/main/fastlane/metadata/android/en-US/images/phoneScreenshots/2.png?raw=true" width="32%"> <img src="https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/blob/main/fastlane/metadata/android/en-US/images/phoneScreenshots/3.png?raw=true" width="32%"> <img src="https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/blob/main/fastlane/metadata/android/en-US/images/phoneScreenshots/4.png?raw=true" width="32%"> <img src="https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/blob/main/fastlane/metadata/android/en-US/images/phoneScreenshots/5.png?raw=true" width="32%"> <img src="https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/blob/main/fastlane/metadata/android/en-US/images/phoneScreenshots/6.png?raw=true" width="32%">
hi: <img src="screenshots.png" alt="Screenshots" height="90">

# licenseSection
source: ## License ```text Copyright Â© 2021 Ankit Sangwan BlackHole is a free software licensed under GPL v3.0 It is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. ``` ```text Being Open Source doesn't mean you can just make a copy of the app and upload it on playstore or sell a closed source copy of the same. Read the following carefully: 1. Any copy of a software under GPL must be under same license. So you can't upload the app on a closed source app repository like PlayStore/AppStore without distributing the source code. 2. You can't sell any copied/modified version of the app under any "non-free" license. You must provide the copy with the original software or with instructions on how to obtain original software, should clearly state all changes, should clearly disclose full source code, should include same license and all copyrights should be retained. In simple words, You can ONLY use the source code of this app for `Open Source` Project under `GPL v3.0` or later with all your source code CLEARLY DISCLOSED on any code hosting platform like GitHub, with clear INSTRUCTIONS on how to obtain the original software, should clearly STATE ALL CHANGES made and should RETAIN all copyrights. Use of this software under any "non-free" license is NOT permitted. ``` See the [GNU General Public License](https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/blob/main/LICENSE) for more details.
hi: ## लाइसेंस ```text Copyright © 2021 Ankit Sangwan BlackHole is a free software licensed under GPL v3.0 It is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. ``` ```text Being Open Source doesn't mean you can just make a copy of the app and upload it on playstore or sell a closed source copy of the same. Read the following carefully: 1. Any copy of a software under GPL must be under same license. So you can't upload the app on a closed source app repository like PlayStore/AppStore without distributing the source code. 2. You can't sell any copied/modified version of the app under any "non-free" license. You must provide the copy with the original software or with instructions on how to obtain original software, should clearly state all changes, should clearly disclose full source code, should include same license and all copyrights should be retained. In simple words, You can ONLY use the source code of this app for `Open Source` Project under `GPL v3.0` or later with all your source code CLEARLY DISCLOSED on any code hosting platform like GitHub, with clear INSTRUCTIONS on how to obtain the original software, should clearly STATE ALL CHANGES made and should RETAIN all copyrights. Use of this software under any "non-free" license is NOT permitted. ``` See the [GNU General Public License](https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/blob/main/LICENSE) for more details.

# buildFromSource
source: ## Building from Source 1. If you don't have Flutter SDK installed, please visit official [Flutter](https://flutter.dev/) site. 2. Fetch latest source code from master branch. ```bash git clone https://github.com/I-Am-Saksham-Srivastavaa/BlackHole.git ``` 3. Run the app with Android Studio or VS Code. Or the command line: ```bash flutter pub get flutter run ```
hi: ## स्रोत से निर्माण 1. यदि आपके पास Flutter SDK स्थापित नहीं है, तो कृपया आधिकारिक [Flutter](https://flutter.dev/) साइट पर जाएँ। 2. मास्टर शाखा से नवीनतम स्रोत कोड लाएं ```bash git clone https://github.com/I-Am-Saksham-Srivastavaa/BlackHole.git cd BlackHole flutter pub get ``` 3. एप्लिकेशन चलाएँ ```bash flutter run ```

# contributeSection
source: ## Contribute Contributions are welcome. Please read our [contributing guidelines](https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/blob/main/CONTRIBUTING.md) before contributing.
hi: ## योगदान करें योगदान का स्वागत है। कृपया योगदान करने से पहले हमारे [योगदान दिशानिर्देश](https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/blob/main/CONTRIBUTING.md) पढ़ें।

# commonIssuesSection
source: ## Facing any Issue? Have a look at some [common Issues](https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/wiki/Common-Issues) that you might face. If your problem is not there, feel free to open an Issue :)
hi: ## कोई समस्या आ रही है? आप कुछ [सामान्य समस्याओं](https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/blob/main/FAQ.md) की जांच कर सकते हैं।

# betaSection
source: ## Want to test Beta Versions? Need help?? You can join our [Telegram Channel](https://t.me/blackhole_official) or [Telegram Group](https://t.me/joinchat/fHDC1AWnOhw0ZmI9), if you have any query, or need help with something as well as to get beta updates of the project.
hi: ## बीटा संस्करण का परीक्षण करना चाहते हैं? मदद चाहिए? आप हमारे [टेलीग्राम चैनल](https://t.me/blackhole_official) या [टेलीग्राम समूह](https://t.me/joinchat/fHDC1AWnOhw0ZmI9) में शामिल हो सकते हैं, यदि आपके पास कोई प्रश्न है, या किसी चीज़ में मदद चाहिए, साथ ही प्रोजेक्ट के बीटा अपडेट प्राप्त करने के लिए।

# coffeeSection
source: ## Liked my work? <a href="https://www.buymeacoffee.com/ankitsangwan" target="_blank"><img src="https://www.buymeacoffee.com/assets/img/custom_images/orange_img.png" alt="Buy Me A Coffee"></a>
hi: ## मेरा काम पसंद आया? <a href="https://www.buymeacoffee.com/ankitsangwan" target="_blank"><img src="https://www.buymeacoffee.com/assets/img/custom_images/orange_img.png" alt="Buy Me A Coffee"></a>

# whatsNewSection
source: ## What's New To read full changelog visit the [wiki page](https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/wiki/Changelog)
hi: ## क्या नया है पूर्ण चेंजलॉग पढ़ने के लिए [विकि पृष्ठ](https://github.com/I-Am-Saksham-Srivastavaa/BlackHole/blob/main/CHANGELOG.md) पर जाएँ।

# disclaimerSection
source: ## Disclaimer ```text BlackHole does not own or have any affiliation with the songs and other content available through the app. All songs and other content are the property of their respective owners and are protected by copyright law. BlackHole is not responsible for any infringement of copyright or other intellectual property rights that may result from the use of the songs and other content available through the app. BlackHole uses third-party plugins and is not responsible for any harm or damage to the respective owners or any other parties resulting from the use of the songs and other content through the third-party plugins. By using the app, you agree to use the songs and other content only for personal, non-commercial purposes and in compliance with all applicable laws and regulations. ```
hi: ## अस्वीकरण ```text BlackHole गानों और ऐप के माध्यम से उपलब्ध अन्य सामग्री का मालिक नहीं है और न ही उनका कोई संबंध है। सभी गाने और अन्य सामग्री उनके संबंधित मालिकों की संपत्ति हैं और कॉपीराइट कानून द्वारा संरक्षित हैं। BlackHole गानों और ऐप के माध्यम से उपलब्ध अन्य सामग्री के उपयोग से उत्पन्न होने वाले कॉपीराइट या अन्य बौद्धिक संपदा अधिकारों के किसी भी उल्लंघन के लिए जिम्मेदार नहीं है। BlackHole तृतीय-पक्ष प्लगइन्स का उपयोग करता है और गानों और तृतीय-पक्ष प्लगइन्स के माध्यम से उपलब्ध अन्य सामग्री के उपयोग से संबंधित मालिकों या अन्य पक्षों को होने वाले किसी भी नुकसान या क्षति के लिए जिम्मेदार नहीं है। ऐप का उपयोग करके, आप गानों और अन्य सामग्री का उपयोग केवल व्यक्तिगत, गैर-व्यावसायिक उद्देश्यों के लिए और सभी लागू कानूनों और विनियमों के अनुपालन में करने के लिए सहमत होते हैं। ```
